tests/ycsb/results/bw_bench_20260417_092512/phase1_load.txt
/usr/bin/java  -classpath /tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-cxl-bench-2210/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-2210/tests/ycsb/workloads/workload_bw_saturate -p recordcount=1000000 -p fieldlength=10240 -p redis.host=127.0.0.1 -p redis.port=6379 -p redis.timeout=30000 -p threadcount=8
Command line: -load -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-2210/tests/ycsb/workloads/workload_bw_saturate -p recordcount=1000000 -p fieldlength=10240 -p redis.host=127.0.0.1 -p redis.port=6379 -p redis.timeout=30000 -p threadcount=8
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-04-17 09:25:16:474 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-17 09:25:26:448 10 sec: 54243 operations; 5423.76 current ops/sec; est completion in 2 minutes [INSERT: Count=54293, Max=90239, Min=132, Avg=1456.76, 90=2055, 99=8575, 99.9=24863, 99.99=50463] 
2026-04-17 09:25:36:442 20 sec: 120481 operations; 6624.46 current ops/sec; est completion in 2 minutes [INSERT: Count=66198, Max=33823, Min=165, Avg=1201.72, 90=1429, 99=5031, 99.9=12415, 99.99=29823] 
2026-04-17 09:25:46:442 30 sec: 176279 operations; 5579.8 current ops/sec; est completion in 2 minutes [INSERT: Count=55798, Max=55583, Min=125, Avg=1429.36, 90=2535, 99=9239, 99.9=22623, 99.99=41279] 
2026-04-17 09:25:56:445 40 sec: 244063 operations; 6777.72 current ops/sec; est completion in 2 minutes [INSERT: Count=67781, Max=59711, Min=133, Avg=1177.63, 90=1559, 99=6151, 99.9=16063, 99.99=26559] 
2026-04-17 09:26:06:442 50 sec: 321547 operations; 7749.17 current ops/sec; est completion in 1 minute [INSERT: Count=77477, Max=23007, Min=115, Avg=1029.59, 90=1272, 99=6063, 99.9=10903, 99.99=19519] 
2026-04-17 09:26:16:441 60 sec: 402406 operations; 8085.9 current ops/sec; est completion in 1 minute [INSERT: Count=80863, Max=21551, Min=118, Avg=987.16, 90=1232, 99=5327, 99.9=9135, 99.99=18239] 
2026-04-17 09:26:26:441 70 sec: 469823 operations; 6741.7 current ops/sec; est completion in 1 minute [INSERT: Count=67421, Max=44351, Min=106, Avg=1183.25, 90=2010, 99=6619, 99.9=14767, 99.99=44127] 
2026-04-17 09:26:36:445 80 sec: 529455 operations; 5962.01 current ops/sec; est completion in 1 minute [INSERT: Count=59627, Max=58303, Min=127, Avg=1338.97, 90=2341, 99=7175, 99.9=22543, 99.99=40159] 
2026-04-17 09:26:46:441 90 sec: 605839 operations; 7639.93 current ops/sec; est completion in 59 seconds [INSERT: Count=76388, Max=35775, Min=113, Avg=1044.73, 90=1555, 99=5731, 99.9=12375, 99.99=26463] 
2026-04-17 09:26:56:441 100 sec: 667640 operations; 6180.1 current ops/sec; est completion in 50 seconds [INSERT: Count=61800, Max=40703, Min=140, Avg=1291.54, 90=2107, 99=7455, 99.9=17471, 99.99=40223] 
2026-04-17 09:27:06:442 110 sec: 722159 operations; 5451.9 current ops/sec; est completion in 43 seconds [INSERT: Count=54518, Max=64511, Min=144, Avg=1464.22, 90=2555, 99=8003, 99.9=22575, 99.99=63359] 
2026-04-17 09:27:16:441 120 sec: 770684 operations; 4852.5 current ops/sec; est completion in 36 seconds [INSERT: Count=48524, Max=51327, Min=119, Avg=1645.73, 90=2845, 99=8551, 99.9=23679, 99.99=42463] 
2026-04-17 09:27:26:443 130 sec: 830272 operations; 5958.8 current ops/sec; est completion in 27 seconds [INSERT: Count=59587, Max=25407, Min=116, Avg=1340.61, 90=2167, 99=6279, 99.9=11743, 99.99=21023] 
2026-04-17 09:27:36:441 140 sec: 885998 operations; 5572.6 current ops/sec; est completion in 19 seconds [INSERT: Count=55725, Max=22527, Min=127, Avg=1433.32, 90=2311, 99=6675, 99.9=13183, 99.99=20143] 
2026-04-17 09:27:46:443 150 sec: 924527 operations; 3852.51 current ops/sec; est completion in 13 seconds [INSERT: Count=38529, Max=86463, Min=151, Avg=2072.95, 90=3599, 99=12087, 99.9=36031, 99.99=85311] 
2026-04-17 09:27:56:441 160 sec: 950703 operations; 2617.86 current ops/sec; est completion in 9 second [INSERT: Count=26177, Max=58495, Min=197, Avg=3052.75, 90=5299, 99=21807, 99.9=41567, 99.99=52031] 
2026-04-17 09:28:06:442 170 sec: 975965 operations; 2526.2 current ops/sec; est completion in 5 second [INSERT: Count=25259, Max=53695, Min=173, Avg=3161.4, 90=5615, 99=21407, 99.9=42751, 99.99=52927] 
2026-04-17 09:28:12:910 176 sec: 1000000 operations; 3715.41 current ops/sec; [CLEANUP: Count=8, Max=11911, Min=88, Avg=1591.5, 90=178, 99=11911, 99.9=11911, 99.99=11911] [INSERT: Count=24035, Max=104127, Min=143, Avg=2096.04, 90=3533, 99=12151, 99.9=47359, 99.99=103487] 
[OVERALL], RunTime(ms), 176469
[OVERALL], Throughput(ops/sec), 5666.717667125671
[TOTAL_GCS_G1_Young_Generation], Count, 377
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 636
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3604032436291927
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 377
[TOTAL_GC_TIME], Time(ms), 636
[TOTAL_GC_TIME_%], Time(%), 0.3604032436291927
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 1591.5
[CLEANUP], MinLatency(us), 88
[CLEANUP], MaxLatency(us), 11911
[CLEANUP], 95thPercentileLatency(us), 11911
[CLEANUP], 99thPercentileLatency(us), 11911
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 1406.501893
[INSERT], MinLatency(us), 106
[INSERT], MaxLatency(us), 104127
[INSERT], 95thPercentileLatency(us), 3791
[INSERT], 99thPercentileLatency(us), 8035
[INSERT], Return=OK, 1000000